### Heroes Of Pymoli Data Analysis
* Of the 1163 active players, the vast majority are male (84%). There also exists, a smaller, but notable proportion of female players (14%).

* Our peak age demographic falls between 20-24 (44.8%) with secondary groups falling between 15-19 (18.60%) and 25-29 (13.4%).  
-----

### Note
* Instructions have been included for each segment. You do not have to follow them exactly, but they are included to help you think through the steps.

In [85]:

# Dependencies and Setup
import pandas as pd

# File to Load (Remember to Change These)
file_to_load = "Resources/purchase_data.csv"

In [182]:


# Read Purchasing File and store into Pandas data frame
purchase_data = pd.read_csv(file_to_load)

total_players = purchase_data['SN'].nunique()
total_players

576

## Player Count

* Display the total number of players

In [96]:
#Display the total number of players (unique)
unique_items=purchase_data['Item ID'].nunique()
average_price=round(purchase_data['Price'].mean(), 2)
number_of_purchases=purchase_data['Price'].count()
total_revenue=purchase_data['Price'].sum()
#summary_df=
print(total_players, unique_items, average_price, number_of_purchases, total_revenue)

576 183 3.05 780 2379.77

In [97]:
unique_items

183

In [98]:
male_players=purchase_data[["Gender","SN"]].nunique()
male_players

Gender      3
SN        576
dtype: int64

## Purchasing Analysis (Total)

* Run basic calculations to obtain number of unique items, average price, etc.


* Create a summary data frame to hold the results


* Optional: give the displayed data cleaner formatting


* Display the summary data frame

In [8]:
unique_items=purchase_data[["Item ID"]].nunique()
unique_items

Item ID    183
dtype: int64

In [11]:
number_purchases=purchase_data[["Purchase ID"]].nunique()
number_purchases

Purchase ID    780
dtype: int64

In [13]:
total_revenue=purchase_data["Price"].sum()
total_revenue

2379.77

In [14]:
average_price=purchase_data["Price"].mean()
average_price

3.050987179487176

   Number of Unique Items Average Price Number of Purchases Total Revenue
0                     183         $3.05                 780     $2,379.77

In [142]:
gender_breakdown=purchase_data.groupby('Gender')['SN'].nunique() #gather the unique SN by gender not double counted
print(gender_breakdown)
percent_breakdown=purchase_data['Gender'].value_counts(normalize=True)*100
print(percent_breakdown)
#purchase_data.groupby(purchase_data['Gender']).count()
#percent_breakdown

Gender
Female                    81
Male                     484
Other / Non-Disclosed     11
Name: SN, dtype: int64
Male                     83.589744
Female                   14.487179
Other / Non-Disclosed     1.923077
Name: Gender, dtype: float64

## Gender Demographics

* Percentage and Count of Male Players


* Percentage and Count of Female Players


* Percentage and Count of Other / Non-Disclosed

                       Total Count  Percentage of Players
Male                           484                  84.03
Female                          81                  14.06
Other / Non-Disclosed           11                   1.91

In [143]:
user_purchase=purchase_data.groupby(by =["Gender","SN", "Item ID"]).sum()

user_purchase.head()

                              Purchase ID  Age  Price
Gender SN            Item ID
Female Adastirin33   175              142   35   4.48
       Aerithllora36 82               274   29   4.90
                     153              578   29   3.74
       Aethedru70    60               775   21   3.54
       Aidain51      35               516   39   3.45

In [20]:
# Create a subset of the purchase_data dataframe called get_female_records and gather all data related to Female Gender
# Creating a boolean list to extract only Female="TRUE" rows
get_female_records=purchase_data['Gender']=="Female"
#referencee the get_female_records dataframe to extract only records identified as female
female_data=purchase_data[get_female_records]

female_data.head()

,Purchase ID,SN,Age,Gender,Item ID,Item Name,Price
15,15,Lisassa64,21,Female,98,"Deadline, Voice Of Subtlety",2.89
18,18,Reunasu60,22,Female,82,Nirvana,4.90
38,38,Reulae52,10,Female,116,Renewed Skeletal Katana,4.18
41,41,Assosia88,20,Female,7,"Thorn, Satchel of Dark Souls",1.33
55,55,Phaelap26,25,Female,84,Arcane Gem,3.79

In [218]:
#Calculate the average item price for females
female_average_price=female_data["Price"].mean()
female_average_price

3.203008849557519

In [102]:
#Get total number of purchases for females
female_data["Purchase ID"].count() #this is working for female purchase count

113

In [225]:
#Sum female purchases Total Purchase Value
female_data["Price"].sum()

361.94

In [100]:
female_data
#Take Female sales data and group by individual and sum the individuals purchases and get total for individual
female_data.groupby(by =["SN"]).sum().head()

               Purchase ID  Age  Item ID  Price
SN
Adastirin33            142   35      175   4.48
Aerithllora36          852   58      235   8.64
Aethedru70             775   21       60   3.54
Aidain51               516   39       35   3.45
Aiduesu86              429   22      179   4.48

In [247]:
#Calculate the average purchase per-person 
avg_fem_purchase=female_data.groupby(by =["SN"]).sum()
#Calculate mean from the newly grouped transactions per person 
avg_fem_purchase["Price"].mean()

4.468395061728394

In [144]:
female_data.columns

Index(['Purchase ID', 'SN', 'Age', 'Gender', 'Item ID', 'Item Name', 'Price'], dtype='object')


## Purchasing Analysis (Gender)

* Run basic calculations to obtain purchase count, avg. purchase price, avg. purchase total per person etc. by gender




* Create a summary data frame to hold the results


* Optional: give the displayed data cleaner formatting


* Display the summary data frame

,Purchase Count,Average Purchase Price,Total Purchase Value,Avg Total Purchase per Person
Gender,,,,
Female,113,$3.20,$361.94,$4.47
Male,652,$3.02,"$1,967.64",$4.07
Other / Non-Disclosed,15,$3.35,$50.19,$4.56

## Age Demographics

* Establish bins for ages


* Categorize the existing players using the age bins. Hint: use pd.cut()


* Calculate the numbers and percentages by age group


* Create a summary data frame to hold the results


* Optional: round the percentage column to two decimal points


* Display Age Demographics Table

In [206]:
#Creating bins for ages
age_bins=[0,10,15,20,25,30,35,40,100]

ages_df=pd.cut(x=purchase_data['Age'], bins=age_bins)

ages_df.head()

0    (15, 20]
1    (35, 40]
2    (20, 25]
3    (20, 25]
4    (20, 25]
Name: Age, dtype: category
Categories (8, interval[int64]): [(0, 10] < (10, 15] < (15, 20] < (20, 25] < (25, 30] < (30, 35] < (35, 40] < (40, 100]]

In [207]:

purchase_data.head()

,Purchase ID,SN,Age,Gender,Item ID,Item Name,Price,Age Bin
0,0,Lisim78,20,Male,108,"Extraction, Quickblade Of Trembling Hands",3.53,"(15, 20]"
1,1,Lisovynya38,40,Male,143,Frenzied Scimitar,1.56,"(35, 40]"
2,2,Ithergue48,24,Male,92,Final Critic,4.88,"(20, 25]"
3,3,Chamassasya86,24,Male,100,Blindscythe,3.27,"(20, 25]"
4,4,Iskosia90,23,Male,131,Fury,1.44,"(20, 25]"

In [208]:
purchase_data["Age Bin"]=ages_df
purchase_data.head()

,Purchase ID,SN,Age,Gender,Item ID,Item Name,Price,Age Bin
0,0,Lisim78,20,Male,108,"Extraction, Quickblade Of Trembling Hands",3.53,"(15, 20]"
1,1,Lisovynya38,40,Male,143,Frenzied Scimitar,1.56,"(35, 40]"
2,2,Ithergue48,24,Male,92,Final Critic,4.88,"(20, 25]"
3,3,Chamassasya86,24,Male,100,Blindscythe,3.27,"(20, 25]"
4,4,Iskosia90,23,Male,131,Fury,1.44,"(20, 25]"

In [260]:
count_by_bin = purchase_data.groupby('SN')['Age Bin'].value_counts()

In [296]:
count_by_bin=pd.DataFrame(count_by_bin, columns=["SN", "Age Bin"]) 
count_by_bin.index(10)

TypeError: 'MultiIndex' object is not callable

In [276]:
user_age_bin=purchase_data.groupby('SN')["Age Bin"].count()
user_age_bin.head(10)

SN
Adairialis76    1
Adastirin33     1
Aeda94          1
Aela59          1
Aelaria33       1
Aelastirin39    2
Aelidru27       1
Aelin32         3
Aelly27         2
Aellynun67      1
Name: Age Bin, dtype: int64

       Total Count  Percentage of Players
<10             17                   2.95
10-14           22                   3.82
15-19          107                  18.58
20-24          258                  44.79
25-29           77                  13.37
30-34           52                   9.03
35-39           31                   5.38
40+             12                   2.08

## Purchasing Analysis (Age)

* Bin the purchase_data data frame by age


* Run basic calculations to obtain purchase count, avg. purchase price, avg. purchase total per person etc. in the table below


* Create a summary data frame to hold the results


* Optional: give the displayed data cleaner formatting


* Display the summary data frame

,Purchase Count,Average Purchase Price,Total Purchase Value,Avg Total Purchase per Person
10-14,28,$2.96,$82.78,$3.76
15-19,136,$3.04,$412.89,$3.86
20-24,365,$3.05,"$1,114.06",$4.32
25-29,101,$2.90,$293.00,$3.81
30-34,73,$2.93,$214.00,$4.12
35-39,41,$3.60,$147.67,$4.76
40+,13,$2.94,$38.24,$3.19
<10,23,$3.35,$77.13,$4.54

## Top Spenders

* Run basic calculations to obtain the results in the table below


* Create a summary data frame to hold the results


* Sort the total purchase value column in descending order


* Optional: give the displayed data cleaner formatting


* Display a preview of the summary data frame

             Purchase Count Average Purchase Price Total Purchase Value
SN
Lisosia93                 5                  $3.79               $18.96
Idastidru52               4                  $3.86               $15.45
Chamjask73                3                  $4.61               $13.83
Iral74                    4                  $3.40               $13.62
Iskadarya95               3                  $4.37               $13.10

## Most Popular Items

* Retrieve the Item ID, Item Name, and Item Price columns


* Group by Item ID and Item Name. Perform calculations to obtain purchase count, item price, and total purchase value


* Create a summary data frame to hold the results


* Sort the purchase count column in descending order


* Optional: give the displayed data cleaner formatting


* Display a preview of the summary data frame

,,Purchase Count,Item Price,Total Purchase Value
Item ID,Item Name,,,
178,"Oathbreaker, Last Hope of the Breaking Storm",12,$4.23,$50.76
145,Fiery Glass Crusader,9,$4.58,$41.22
108,"Extraction, Quickblade Of Trembling Hands",9,$3.53,$31.77
82,Nirvana,9,$4.90,$44.10
19,"Pursuit, Cudgel of Necromancy",8,$1.02,$8.16

## Most Profitable Items

* Sort the above table by total purchase value in descending order


* Optional: give the displayed data cleaner formatting


* Display a preview of the data frame

,,Purchase Count,Item Price,Total Purchase Value
Item ID,Item Name,,,
178,"Oathbreaker, Last Hope of the Breaking Storm",12,$4.23,$50.76
82,Nirvana,9,$4.90,$44.10
145,Fiery Glass Crusader,9,$4.58,$41.22
92,Final Critic,8,$4.88,$39.04
103,Singed Scalpel,8,$4.35,$34.80